In [116]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [117]:
df = pd.read_csv('data/titanic.csv', index_col='PassengerId')

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [119]:
df.iloc[:5, :4]

,Survived,Pclass,Name,Sex
PassengerId,,,,
1,0,3,"Braund, Mr. Owen Harris",male
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female
3,1,3,"Heikkinen, Miss. Laina",female
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female
5,0,3,"Allen, Mr. William Henry",male

In [120]:
ppl_survived = len(df[df['Survived'] == 1])
ppl_data = len(df)

In [121]:
#38.38% of the people in the data survived
round(ppl_survived / ppl_data * 100, 2)

38.38

In [122]:
Ages = df['Age']
Ages_filter_s = (df['Age'] > 50) & (df['Survived'] == 0)
Ages_filter_d = (df['Age'] > 50) & (df['Survived'] == 1)
Ages_filter = df['Age'] > 50

In [123]:
#the percentage of passengers who survived above age 49 in the data
round(len(df[Ages_filter_s]) / len(df[Ages_filter]), 4) * 100

65.62

In [124]:
Ages[:20]

PassengerId
1     22.0
2     38.0
3     26.0
4     35.0
5     35.0
6      NaN
7     54.0
8      2.0
9     27.0
10    14.0
11     4.0
12    58.0
13    20.0
14    39.0
15    14.0
16    55.0
17     2.0
18     NaN
19    31.0
20     NaN
Name: Age, dtype: float64